Autodesk.Revit.DB.DarkSiteSettings.IsAddinEnabled(System.String)
Check if the addin is enabled in the current Dark Site environment.
addinName:
Name of the addin to check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.DarkSiteSettings.IsCommandEnabled(System.String)
Check if the command id is enabled in the current Dark Site environment.
commandId:
Identifier of the command to check (the command string that is logged in journals when running the command. E.g. ID_COORDINATIONMODEL_ADD_AUTODESKDOCS).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.DarkSiteSettings.IsFeatureEnabled(System.String)
Check if the feature is enabled in the current Dark Site environment.
featureName:
Name of the feature to check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.DarkSiteSettings.GetInstance
Get the singleton instance of the DarkSiteSettings.
Returns:
Returns the singleton manager of the settings for dark sites environments.
Since:
2026

Autodesk.Revit.DB.DarkSiteSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DarkSiteSettings
Manage settings for the dark sites.
Since:
2026